Revit 2026 API

# FabricAreaMinorSheetAlignment Property

---

The fabric sheet alignment in the fabric distribution in the minor direction.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FabricSheetAlignment MinorSheetAlignment { get; set; }
```
```vb
Public Property MinorSheetAlignment As FabricSheetAlignment
	Get
	Set
```
```cpp
public:
property FabricSheetAlignment MinorSheetAlignment {
	FabricSheetAlignment get ();
	void set (FabricSheetAlignment value);
}
```
```fsharp
member MinorSheetAlignment : FabricSheetAlignment with get, set
```

#### Property Value

FabricSheetAlignment

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

Changing the value of this property causes change of MinorLapSplice and LapSplicePosition properties if needed

#### Reference

FabricArea Class

Autodesk.Revit.DB.Structure Namespace